In [1]:
import pandas as pd

In [8]:
!cat examples/ex1.csv

9,10,11,12,foo

# read from fils

## read.csv()

In [9]:
df = pd.read_csv('examples/ex1.csv')

In [10]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

read_table()

In [3]:
pd.read_table('examples/ex1.csv', sep=',')

/Users/BirdFish/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### file without a header row

In [5]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

**assign default column names:**

In [6]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

**specify names yourself:**

In [7]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

indicating index

In [8]:
names = ['a', 'b', 'c', 'd', 'message']

In [9]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

### hierachical index

In the event that you want to form a hierarchical index from multiple columns, pass a list of column numbers or names:

In [10]:
!cat examples/csv_mindex.csv

key1, key2, value1, value2
one, a, 1, 2
one, b, 3, 4
one, c, 5, 6
one, d, 7, 8
two, a, 9, 10
two, b, 11, 12
two, c, 13, 14
two, d, 15, 16

In [16]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

### mixed delimiter

In [18]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [19]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

/Users/BirdFish/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [20]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

### skip rows when importing

In [21]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [22]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### handling missing values

Missing data is usually either not present (empty string) or marked by some sentinel value. By default, pandas uses a set of commonly occurring sentinels, such as NA and NULL:

In [23]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [24]:
result = pd.read_csv('examples/ex5.csv')

In [25]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

The na_values option can take either a list or set of strings to consider missing values:

In [27]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [28]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

Different NA sentinels can be specified for each column in a dict:

In [29]:
sentinels = {'message':['foo', 'NA'], 'something':['two']}

In [30]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## reading text files in pieces

In [31]:
pd.options.display.max_rows = 10

In [32]:
result = pd.read_csv('examples/ex6.csv')

In [33]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [35]:
pd.read_csv('examples/ex6.csv',nrows=5)    # read only 5 rows

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

To read a file in pieces, specify a chunksize as a number of rows:

In [42]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [43]:
chunker

The TextParser object returned by read_csv allows you to iterate over the parts of the file according to the chunksize. For example, we can iterate over ex6.csv, aggregating the value counts in the 'key' column like so:

In [44]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [45]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## writing data to text

In [46]:
data = pd.read_csv('examples/ex5.csv')

In [47]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [48]:
data.to_csv('examples/out.csv')

In [49]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

### designate seperator

In [50]:
data.to_csv('examples/out2.csv', sep='|')

In [52]:
!cat examples/out2.csv

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

### designate sentinel valus:

Missing values appear as empty strings in the output. You might want to denote them by some other sentinel value:

In [53]:
import sys

data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

### disable row labels/column labels

In [54]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

### write only a subset of the columns

In [55]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### write Series to csv

In [56]:
dates = pd.date_range('1/1/2000', periods=7)

In [57]:
ts = pd.Series(np.arange(7), index=dates)

In [58]:
ts.to_csv('examples/tseries.csv')

/Users/BirdFish/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [59]:
!cat examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

## working with delimited formats

In [1]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [4]:
import csv
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [5]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [14]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

split the lines into the header line and the data lines:

In [7]:
header, values = lines[0], lines[1:]

Then we can create a dictionary of data columns using a dictionary comprehension and the expression zip(*values), which transposes rows to columns:

In [8]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### customize csv class

CSV files come in many different flavors. To define a new format with a different delimiter, string quoting convention, or line terminator, we define a simple subclass of csv.Dialect:

In [12]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '""'
    quoting = csv.QUOTE_MINIMAL

In [ ]:
reader = csv.reader(f, dialect = my_dialect)

We can also give individual CSV dialect parameters as keywords to csv.reader without having to define a subclass:

In [ ]:
reader = csv.reader(f, delimiter = '|')

The possible options (attributes of csv.Dialect):

![csv](https://github.com/Zlisu/Notes/blob/master/Images/NumPy/csv_opts.png?raw=True)

### write delimited files manually

In [18]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

TypeError: "quotechar" must be a 1-character string

## JSON data

In [20]:
obj = """ 
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"], 
 "pet": null, 
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, 
              {"name": "Katie", "age": 38, 
               "pets": ["Sixes", "Stache", "Cisco"]}] 
} """

### built-in json library

In [21]:
import json

In [22]:
result = json.loads(obj)

In [23]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

json.dumps, on the other hand, converts a Python object back to JSON:

In [24]:
asjson = json.dumps(result)

How you convert a JSON object or list of objects to a DataFrame or some other data structure for analysis will be up to you. Conveniently, you can pass a list of dicts (which were previously JSON objects) to the DataFrame constructor and select a subset of the data fields:

In [29]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age', 'pets'])

In [30]:
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

The pandas.read_json can automatically convert JSON datasets in specific arrangements into a Series or DataFrame. For example:

In [31]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

### pandas.read_json

The default options for pandas.read_json assume that each object in the JSON array is a row in the table:

In [32]:
data = pd.read_json('examples/example.json')

In [33]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### export data from pandas to JSON

In [34]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [35]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML

The pandas.read_html function has a number of options, but by default it searches for and attempts to parse all tabular data contained within <table> tags. The result is a list of DataFrame objects:

In [4]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [40]:
tables

[                                  Bank Name             City  ST   CERT  \
 0                               Allied Bank         Mulberry  AR     91
 1              The Woodbury Banking Company         Woodbury  GA  11297
 2                    First CornerStone Bank  King of Prussia  PA  35312
 3                        Trust Company Bank          Memphis  TN   9956
 4                North Milwaukee State Bank        Milwaukee  WI  20364
 5                    Hometown National Bank         Longview  WA  35156
 6                       The Bank of Georgia   Peachtree City  GA  35259
 7                              Premier Bank           Denver  CO  34112
 8                            Edgebrook Bank          Chicago  IL  57772
 9                    Doral Bank  En Espanol         San Juan  PR  32102
 10        Capitol City Bank & Trust Company          Atlanta  GA  33938
 11                  Highland Community Bank          Chicago  IL  20290
 12         First National Bank of Crestview        Crestview  FL  17557
 13                       Northern Star Bank          Mankato  MN  34983
 14   Frontier Bank, FSB D/B/A El Paseo Bank      Palm Desert  CA  34738
 15    The National Republic Bank of Chicago          Chicago  IL    916
 16                           NBRS Financial       Rising Sun  MD   4862
 17                    GreenChoice Bank, fsb          Chicago  IL  28462
 18                 Eastside Commercial Bank          Conyers  GA  58125
 19                   The Freedom State Bank          Freedom  OK  12483
 20                              Valley Bank  Fort Lauderdale  FL  21793
 21                              Valley Bank           Moline  IL  10450
 22              Slavie Federal Savings Bank          Bel Air  MD  32368
 23                    Columbia Savings Bank       Cincinnati  OH  32284
 24             AztecAmerica Bank En Espanol           Berwyn  IL  57866
 25                    Allendale County Bank          Fairfax  SC  15062
 26                       Vantage Point Bank          Horsham  PA  58531
 27    Millennium Bank, National Association         Sterling  VA  35096
 28                             Syringa Bank            Boise  ID  34296
 29                        The Bank of Union          El Reno  OK  17967
 ..                                      ...              ...  ..    ...
 517                       ANB Financial, NA      Bentonville  AR  33901
 518                               Hume Bank             Hume  MO   1971
 519                  Douglass National Bank      Kansas City  MO  24660
 520                       Miami Valley Bank         Lakeview  OH  16848
 521                                 NetBank       Alpharetta  GA  32575
 522               Metropolitan Savings Bank       Pittsburgh  PA  35353
 523                         Bank of Ephraim          Ephraim  UT   1249
 524                           Reliance Bank     White Plains  NY  26778
 525   Guaranty National Bank of Tallahassee      Tallahassee  FL  26838
 526                     Dollar Savings Bank           Newark  NJ  31330
 527                    Pulaski Savings Bank     Philadelphia  PA  27203
 528   First National Bank of Blanchardville   Blanchardville  WI  11639
 529                   Southern Pacific Bank         Torrance  CA  27094
 530             Farmers Bank of Cheneyville      Cheneyville  LA  16445
 531                           Bank of Alamo            Alamo  TN   9961
 532  AmTrade International Bank  En Espanol          Atlanta  GA  33784
 533          Universal Federal Savings Bank          Chicago  IL  29355
 534            Connecticut Bank of Commerce         Stamford  CT  19183
 535                        New Century Bank  Shelby Township  MI  34979
 536                   Net 1st National Bank       Boca Raton  FL  26652
 537                            NextBank, NA          Phoenix  AZ  22314
 538                Oakwood Deposit Bank Co.          Oakwood  OH   8966
 539                   Bank of Sierra Blanca    Sierra Blanca  TX  22002
 540           Hamilton Bank, NA  En Espanol            Miami  FL  24382
 541                  Sinclair National Bank         Gravette  AR  34248
 542                      Superior Bank, FSB         Hinsdale  IL  32646
 543                     Malta National Bank            Malta  OH   6629
 544         First Alliance Bank & Trust Co.       Manchester  NH  34264
 545       National State Bank of Metropolis       Metropolis  IL   3815
 546                        Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 5                         Twin City Bank     October 2, 2015
 6                          Fidelity Bank     October 2, 2015
 7              United Fidelity Bank, fsb       July 10, 2015
 8               Republic Bank of Chicago         May 8, 2015
 9           Banco Popular de Puerto Rico   February 27, 2015
 10   First-Citizens Bank & Trust Company   February 13, 2015
 11             United Fidelity Bank, fsb    January 23, 2015
 12                        First NBC Bank    January 16, 2015
 13                             BankVista   December 19, 2014
 14     Bank of Southern California, N.A.    November 7, 2014
 15                   State Bank of Texas    October 24, 2014
 16                           Howard Bank    October 17, 2014
 17                  Providence Bank, LLC       July 25, 2014
 18             Community & Southern Bank       July 18, 2014
 19       Alva State Bank & Trust Company       June 27, 2014
 20   Landmark Bank, National Association       June 20, 2014
 21                   Great Southern Bank       June 20, 2014
 22                         Bay Bank, FSB        May 30, 2014
 23             United Fidelity Bank, fsb        May 23, 2014
 24              Republic Bank of Chicago        May 16, 2014
 25                   Palmetto State Bank      April 25, 2014
 26                     First Choice Bank   February 28, 2014
 27                  WashingtonFirst Bank   February 28, 2014
 28                          Sunwest Bank    January 31, 2014
 29                             BancFirst    January 24, 2014
 ..                                   ...                 ...
 517       Pulaski Bank and Trust Company         May 9, 2008
 518                        Security Bank       March 7, 2008
 519       Liberty Bank and Trust Company    January 25, 2008
 520         The Citizens Banking Company     October 4, 2007
 521                           ING DIRECT  September 28, 2007
 522  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 523                        Far West Bank       June 25, 2004
 524                     Union State Bank      March 19, 2004
 525              Hancock Bank of Florida      March 12, 2004
 526                          No Acquirer   February 14, 2004
 527                       Earthstar Bank   November 14, 2003
 528                        The Park Bank         May 9, 2003
 529                            Beal Bank    February 7, 2003
 530            Sabine State Bank & Trust   December 17, 2002
 531                          No Acquirer    November 8, 2002
 532                          No Acquirer  September 30, 2002
 533               Chicago Community Bank       June 27, 2002
 534                   Hudson United Bank       June 26, 2002
 535                          No Acquirer      March 28, 2002
 536                       Bank Leumi USA       March 1, 2002
 537                          No Acquirer    February 7, 2002
 538       The State Bank & Trust Company    February 1, 2002
 539     The Security State Bank of Pecos    January 18, 2002
 540     Israel Discount Bank of New York    January 11, 2002
 541                   Delta Trust & Bank   September 7, 2001
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

            Updated Date
 0     November 17, 2016
 1     November 17, 2016
 2     September 6, 2016
 3     September 6, 2016
 4         June 16, 2016
 5        April 13, 2016
 6      October 24, 2016
 7       August 17, 2016
 8         July 12, 2016
 9          May 13, 2015
 10       April 21, 2015
 11       April 21, 2015
 12     January 15, 2016
 13      January 6, 2016
 14    November 10, 2016
 15      January 6, 2016
 16       March 26, 2015
 17        July 28, 2015
 18        July 11, 2016
 19       March 25, 2016
 20        June 29, 2015
 21        June 26, 2015
 22        June 15, 2015
 23    November 10, 2016
 24     October 20, 2016
 25        July 18, 2014
 26        March 3, 2015
 27       March 03, 2015
 28       April 12, 2016
 29       March 25, 2016
 ..                  ...
 517     August 28, 2012
 518     August 28, 2012
 519    October 26, 2012
 520  September 12, 2016
 521     August 28, 2012
 522    October 27, 2010
 523       April 9, 2008
 524       April 9, 2008
 525        June 5, 2012
 526       April 9, 2008
 527       July 22, 2005
 528        June 5, 2012
 529    October 20, 2008
 530    October 20, 2004
 531      March 18, 2005
 532  September 11, 2006
 533       April 9, 2008
 534   February 14, 2012
 535      March 18, 2005
 536       April 9, 2008
 537    February 5, 2015
 538    October 25, 2012
 539    November 6, 2003
 540  September 21, 2015
 541   February 10, 2004
 542     August 19, 2014
 543   November 18, 2002
 544   February 18, 2003
 545      March 17, 2005
 546      March 17, 2005

 [547 rows x 7 columns]]

In [5]:
len(tables)

1

In [8]:
failures = tables[0]

In [9]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [10]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [11]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

### Parsing XML with ixml.objectify

In [12]:
from lxml import objectify

In [13]:
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

root.INDICATOR returns a generator yielding each <INDICATOR> XML element. For
each record, we can populate a dict of tag names (like YTD_ACTUAL) to data values
(excluding a few tags):

In [14]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

Lastly, convert this list of dicts into a DataFrame:

In [15]:
perf = pd.DataFrame(data)

perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [17]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [18]:
root

In [19]:
root.get('href')

'http://www.google.com'

In [20]:
root.text

'Google'

# Binary Data Formats

### pickle

One of the easiest ways to store data (also known as serialization) efficiently in binary format is using Pythonâ€™s built-in pickle serialization. pandas objects all have a to_pickle method that writes the data to disk in pickle format:

In [21]:
frame = pd.read_csv('examples/ex1.csv')

In [22]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
frame.to_pickle('examples/frame_pickle')

In [24]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### HDF5

While itâ€™s possible to directly access HDF5 files using either the PyTables or h5py libraries, pandas provides a high-level interface that simplifies storing Series and DataFrame object. The HDFStore class works like a dict and handles the low-level details:

In [38]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [42]:
store = pd.HDFStore('mydata.h5')

In [43]:
store['obj1'] = frame

In [44]:
store['obj1_col'] = frame['a']

In [45]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [46]:
store['obj1']

           a
0   0.370711
1  -0.136005
2  -1.337699
3   0.144824
4   1.378089
5   1.028020
6  -0.291845
7  -0.612323
8   0.687678
9   0.444700
10 -0.772526
11  0.949704
12  1.861361
13 -1.390044
14 -0.855869
15  0.653611
16  0.044717
17 -0.305140
18 -1.098912
19 -0.629080
20 -0.031552
21  0.938586
22  0.580499
23 -0.120440
24 -1.879060
25 -1.228401
26  1.410399
27 -0.302945
28 -0.616188
29 -0.116932
..       ...
70 -0.897482
71 -0.163582
72  0.979825
73 -0.129337
74 -0.238749
75 -1.268869
76 -0.162486
77  0.260384
78  0.817284
79 -0.669875
80  1.705352
81 -0.148430
82 -0.264204
83  0.396652
84 -0.526605
85 -0.290701
86 -0.784438
87 -0.064014
88  1.552753
89  0.309455
90  0.769010
91  0.042236
92  0.526186
93  0.661816
94 -0.646148
95 -0.247562
96  0.699508
97 -0.232853
98  0.664349
99 -1.379901

[100 rows x 1 columns]

HDFStore supports two storage schemas, 'fixed' and 'table'. The latter is generally slower, but it supports query operations using a special syntax:

In [39]:
store.put('obj2', frame, format='table')

In [41]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.772526
11  0.949704
12  1.861361
13 -1.390044
14 -0.855869
15  0.653611

In [47]:
store.close()

The pandas.read_hdf function gives you a shortcut to these tools:

In [51]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [54]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).

### reading Excel file

To use ExcelFile, create an instance by passing a path to an xls or xlsx file:

In [55]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [56]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [57]:
frame

           a
0   0.370711
1  -0.136005
2  -1.337699
3   0.144824
4   1.378089
5   1.028020
6  -0.291845
7  -0.612323
8   0.687678
9   0.444700
10 -0.772526
11  0.949704
12  1.861361
13 -1.390044
14 -0.855869
15  0.653611
16  0.044717
17 -0.305140
18 -1.098912
19 -0.629080
20 -0.031552
21  0.938586
22  0.580499
23 -0.120440
24 -1.879060
25 -1.228401
26  1.410399
27 -0.302945
28 -0.616188
29 -0.116932
..       ...
70 -0.897482
71 -0.163582
72  0.979825
73 -0.129337
74 -0.238749
75 -1.268869
76 -0.162486
77  0.260384
78  0.817284
79 -0.669875
80  1.705352
81 -0.148430
82 -0.264204
83  0.396652
84 -0.526605
85 -0.290701
86 -0.784438
87 -0.064014
88  1.552753
89  0.309455
90  0.769010
91  0.042236
92  0.526186
93  0.661816
94 -0.646148
95 -0.247562
96  0.699508
97 -0.232853
98  0.664349
99 -1.379901

[100 rows x 1 columns]

To write pandas data to Excel format, you must first create an ExcelWriter, then write data to it using pandas objectsâ€™ to_excel method:

In [58]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [59]:
frame.to_excel(writer, 'Sheet1')

In [60]:
writer.save()

You can also pass a file path to to_excel and avoid the ExcelWriter:

In [61]:
frame.to_excel('examples/ex2.xlsx')

# Interacting with Web APIs

In [2]:
import requests

In [3]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [4]:
resp = requests.get(url)

In [5]:
resp

In [6]:
# The Response objectâ€™s json method will return a dictionary 
# containing JSON parsed into native Python objects:

data=resp.json()

In [7]:
data[0]['title']

'STY: use black'

In [10]:
data[0]['body']

'I have seen a number of other project adopt: https://pypi.org/project/black/, as well as use in my company.\r\n\r\nThis basically is a style formatter that plays nice with flake8 and is completely opionated, the only option is line-length. This is a good thing.\r\n\r\nThis would involve a one-time updating of code (though we can do it somewhat incrementally).'

Each element in data is a dictionary containing all of the data found on a GitHub issue page (except for the comments). We can pass data directly to DataFrame and extract fields of interest:

In [11]:
issues = pd.DataFrame(data, columns=['number' ,'title', 'labels', 'state'])

In [12]:
issues

,number,title,labels,state
0,26926,STY: use black,"[{'id': 106935113, 'node_id': 'MDU6TGFiZWwxMDY...",open
1,26925,Index dtype is changed to object after left join,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
2,26924,DOC: Disallow crawlers in development docs,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
3,26923,Calculate normalized freqs in value_counts cor...,[],open
4,26922,"Link from, for e.g., version/0.22/generate, to...",[],open
5,26921,pandas.DataFrame.plot error for time series data,[],open
6,26920,Lookback methods (rolling/ewm/etc.) should acc...,[],open
7,26919,"BUG: DataFrame(ndarray, dtype=..) does unsafe ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,26918,DOC/EA: developer docs for implementing Series...,[],open
9,26917,Tabular numbers should be used on tables,"[{'id': 195648009, 'node_id': 'MDU6TGFiZWwxOTU...",open
10,26916,"BUG: Fix timedelta64+Timestamp, closes #24775",[],open
11,26915,Should Pandas adopt a naming convention for it...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
12,26914,"WIP/POC: Allow (N, 1) and (1,N) EAs",[],open
13,26913,Tracking issue for supporting various Series o...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
14,26912,Fix miscellaneous small holiday errors,[],open
15,26911,Raise a ValueError when index and data lengths...,[],open
16,26910,BUG: Fix rolling median with closed='left' and...,[],open
17,26909,Update requirements-dev.txt,[],open
18,26908,Difference in time of MultiIndex init,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
19,26906,"DEPR: Timestamp, NaT, TimedeltaIndex, Datetime...","[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
20,26905,Allow multiple lambdas in Groupby.aggregate,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
21,26904,debug CI,[],open
22,26902,Add pytest fixture to control optional dependency,"[{'id': 527603109, 'node_id': 'MDU6TGFiZWw1Mjc...",open
23,26900,CLN: In DecimalArray implement aliases as prop...,[],open
24,26899,Usability: TAB completion no longer works with...,[],open
25,26897,TimedeltaIndex should have a method to help to...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
26,26896,CI: Improve codecov reporting,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
27,26895,CI: Avoid two steps to access azure-pipelines ...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
28,26894,BUG: Fix interval constructor to handle left=r...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
29,26893,Issues with `Interval` handling of left=right ...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open

# interacting with Databases

create a SQLite database
using Pythonâ€™s built-in sqlite3 driver:

In [13]:
import sqlite3

In [14]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20)),
 c REAL,        d INTEGER
);"""

In [17]:
query = """
.....: CREATE TABLE test
.....: (a VARCHAR(20), b VARCHAR(20),
.....: c REAL, d INTEGER
.....: );"""

In [18]:
con = sqlite3.connect('mydata.sqlite')

In [19]:
con.execute(query)

In [21]:
con.commit()

In [26]:
# insert a few rows of data:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [27]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [28]:
con.executemany(stmt, data)

In [29]:
con.commit()

In [30]:
# Most Python SQL drivers (PyODBC, psycopg2, MySQLdb, pymssql, etc.) 
# return a list of tuples when selecting data from a table:

cursor = con.execute('select * from test')

In [31]:
rows = cursor.fetchall()

In [32]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [33]:
# You can pass the list of tuples to the DataFrame constructor, 
# but you also need the column names, 
# contained in the cursorâ€™s description attribute:

cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [34]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

## SQLAlchemy

The SQLAlchemy project is a popular Python SQL toolkit that abstracts
away many of the common differences between SQL databases. pandas has a
read_sql function that enables you to read data easily from a general SQLAlchemy connection.

In [35]:
import sqlalchemy as sqla

In [36]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [37]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5